{"config": [{"config": {"batch_input_shape": [null, 128], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 512, "activation": "relu", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 512, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 4, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_3"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}