{"keras_version": "2.1.2", "config": [{"config": {"bias_constraint": null, "activation": "relu", "trainable": true, "batch_input_shape": [null, 128], "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "units": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "units": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_3", "trainable": true, "bias_regularizer": null, "units": 4, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}