{"keras_version": "2.1.2", "config": [{"config": {"trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 128], "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_1", "units": 512, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_2", "trainable": true, "bias_constraint": null, "units": 512}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_3", "trainable": true, "bias_constraint": null, "units": 4}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}