{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 512, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "batch_input_shape": [null, 128], "name": "dense_1", "kernel_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 512, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 4, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}}], "keras_version": "2.1.2", "backend": "tensorflow"}